import { defineStore } from 'pinia';

export const useDistrictsStore = defineStore('districtsStore',  {
  state: () => ({
    districts: getDistricts(),
  }),
});


function getDistricts() {
    return [
      {
        id: 1,
        name: 'Абзелиловский район'
      },
      {
        id: 2,
        name: 'Альшеевский район'
      },
      {
        id: 3,
        name: 'Архангельский район'
      },
      {
        id: 4,
        name: 'Аскинский район'
      },
      {
        id: 5,
        name: 'Аургазинский район'
      },
      {
        id: 6,
        name: 'Баймакский район'
      },
      {
        id: 7,
        name: 'Бакалинский район'
      },
      {
        id: 8,
        name: 'Балтачевский район'
      },
      {
        id: 9,
        name: 'Белебеевский район'
      },
      {
        id: 10,
        name: 'Белокатайский район'
      },
      {
        id: 11,
        name: 'Белорецкий район'
      },
      {
        id: 12,
        name: 'Бижбулякский район'
      },
      {
        id: 13,
        name: 'Бирский район'
      },
      {
        id: 14,
        name: 'Благоварский район'
      },
      {
        id: 15,
        name: 'Благовещенский район'
      },
      {
        id: 16,
        name: 'Буздякский район'
      },
      {
        id: 17,
        name: 'Бураевский район'
      },
      {
        id: 18,
        name: 'Бурзянский район'
      },
      {
        id: 19,
        name: 'Гафурийский район'
      },
      {
        id: 20,
        name: 'Давлекановский район'
      },
      {
        id: 21,
        name: 'Дуванский район'
      },
      {
        id: 22,
        name: 'Дюртюлинский район'
      },
      {
        id: 23,
        name: 'Ермекеевский район'
      },
      {
        id: 24,
        name: 'Зианчуринский район'
      },
      {
        id: 25,
        name: 'Зилаирский район'
      },
      {
        id: 26,
        name: 'Иглинский район'
      },
      {
        id: 27,
        name: 'Илишевский район'
      },
      {
        id: 28,
        name: 'Ишимбайский район'
      },
      {
        id: 29,
        name: 'Калтасинский район'
      },
      {
        id: 30,
        name: 'Караидельский район'
      },
      {
        id: 31,
        name: 'Кармаскалинский район'
      },
      {
        id: 32,
        name: 'Кигинский район'
      },
      {
        id: 33,
        name: 'Краснокамский район'
      },
      {
        id: 34,
        name: 'Кугарчинский район'
      },
      {
        id: 35,
        name: 'Кушнаренковский район'
      },
      {
        id: 36,
        name: 'Куюргазинский район'
      },
      {
        id: 37,
        name: 'Мелеузовский район'
      },
      {
        id: 38,
        name: 'Мечетлинский район'
      },
      {
        id: 39,
        name: 'Мишкинский район'
      },
      {
        id: 40,
        name: 'Миякинский район'
      },
      {
        id: 41,
        name: 'Нуримановский район'
      },
      {
        id: 42,
        name: 'Салаватский район'
      },
      {
        id: 43,
        name: 'Стерлибашевский район'
      },
      {
        id: 44,
        name: 'Стерлитамакский район'
      },
      {
        id: 45,
        name: 'Татышлинский район'
      },
      {
        id: 46,
        name: 'Туймазинский район'
      },
      {
        id: 47,
        name: 'Уфимский район'
      },
      {
        id: 48,
        name: 'Учалинский район'
      },
      {
        id: 49,
        name: 'Федоровский район'
      },
      {
        id: 50,
        name: 'Хайбуллинский район'
      },
      {
        id: 51,
        name: 'Чекмагушевский район'
      },
      {
        id: 52,
        name: 'Чишминский район'
      },
      {
        id: 53,
        name: 'Шаранский район'
      },
      {
        id: 54,
        name: 'Янаульский район'
      },
      {
        id: 55,
        name: 'Агидель г.о.'
      },
      {
        id: 56,
        name: 'Кумертау г.о.'
      },
      {
        id: 57,
        name: 'Нефтекамск г.о.'
      },
      {
        id: 58,
        name: 'Октябрьский г.о.'
      },
      {
        id: 59,
        name: 'Салават г.о.'
      },
      {
        id: 60,
        name: 'Сибай г.о.'
      },
      {
        id: 61,
        name: 'Стерлитамак г.о.'
      },
      {
        id: 62,
        name: 'Уфа г.о.'
      },
      {
        id: 63,
        name: 'город Межгорье'
      }
    ];
}
